// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "To oprogramowanie musi być zainstalowane na woluminie startowym.";
"ERROR_INSTALL" = "Ten wolumin nie spełnia wymagań dla tego uaktualnienia.";

"Newer_Package_Installed_message" = "Nowsza wersja Chameleona jest już zainstalowana.";
"Intel_Mac_message" = "To oprogramowanie nie może być zainstalowane na tym komputerze.";


// ============================================================================
// Install Type
// ----------------------------------------------------------------------------
"InstallType_title" = "Typ Instalacji";
"InstallType_description" = "Wybierz, by przeprowadzić nową instalację, lub zaktualizować istniejącą.";

"New_title" = "Nowa Instalacja";
"New_description" = "Stwórz kopię istniejącego folderu /Extra, jeśli istnieje on na wybranej parycji. Zostanie utworzony nowy jeśli są wybrane jakiekolwiek opcje, inne niż z kategorii Bootloader.";

"Upgrade_title" = "Aktualizacja";
"Upgrade_description" = "Scal folder /Extra, jeśli istnieje on na wybranej parycji, z opcjami wybranymi w instalatorze, innymi niż z kategorii Bootloader.";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Chameleon Bootloader";
"Chameleon_description" = "Chameleon wymaga trzech podstawowych plików. (mówiąc prosto)
boot0 (Na MBR dysku) odpowiedzialne za ładowanie boot1.
boot1 (Na boot-sektorze partycji) za znalezienie boot2.
boot2 (W gównym katalogu partycji) za ładowanie kernela itp.";

"Standard_title" = "Chameleon Standard";
"Standard_description" = "Ta opcja Instaluje trzy podstawowe pliki i zapisuje boot0 na pierwszych 440 bajtach MBR tak, aby nie zniszczyć istniejącego kodu Windows. Następnie boot0 szuka boot1h na pierwszej aktywnej partycji.
* Ta metoda instalacji ustawia zaznaczoną partycję jako aktywną.";

"EFI_title" = "EFI";
"EFI_description" = "Instaluj pliki Chameleona na domyślnie ukrytej partycji EFI, używając boot0 lub boot0md zależnie od Twojego systemu, bez niszczenia instalacji Windowsa, jeśli taką posiadasz.";

"noboot_title" = "Nic";
"noboot_description" = "Nie instaluj Chameleona (Przydatne podczas instalacji tylko komponentów Extra)";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "Moduły";
"Module_description" = "System modułów chameleona pozwala użytkownikowi, lub programiście rozszerzyć funkcjonalność bootloadera, bez zmian głównego pliku boot.";

"AMDGraphicsEnabler_title" = "AMDGraphicsEnabler";
"AMDGraphicsEnabler_description" = "The GraphicsEnabler ATI code ( > r784) ported to a module.
This code has no support for 'legacy' ATI cards.
If your HD card was supported on the old code and you find
it missing on this, please file an issue at:
http://forge.voodooprojects.org/p/chameleon/issues/
The same applies to any missing card on this code.
Only cards known to work will be added.";

"ATiGraphicsEnabler_title" = "ATiGraphicsEnabler";
"ATiGraphicsEnabler_description" = "The GraphicsEnabler ATI code ( < r784) ported to a module.
Support for 'legacy' cards...
Based on Meklort's work.";

"IntelGraphicsEnabler_title" = "IntelGraphicsEnabler";
"IntelGraphicsEnabler_description" = "Enables a few Intel cards to be used out of the box, mostly mobile ones.";

"klibc_title" = "klibc";
"klibc_description" = "Ten moduł dostarcza standardową bibliotekę c dla innych modułów, jeśli biblioteka w chameleonie jest niewystarczająca.
Aktualnie jest używane tylko przez bibliotekę uClibc++.
Source: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Resolution";
"AutoReso_description" = "Ten moduł odczytuje informacje edid z monitora podpiętego jako główny.
Moduł aktualnie nie jest dołączony do głównego wydania chameleona (trunk) i ma minimalne zastosowanie.
Dodatkowo, moduł zmodyfikuje tryby VESA na kartach Intela starszych niż HD, by umożliwić bootoowanie systemu z wyższą rozdzielczością.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "Ten moduł dostarcza minimalną bibliotekę uruchomieniową c++ dla innych modułów.
Samo z siebie nie dodaje żadnej funkcjonalności, jest używana, by pozwolić na wykorzystanie języka c++ w innych modułach.
Uwaga: rtti i exceptions zostały wyłączone.
Źródło: http://cxx.uclibc.org/
Zależności: klibc";

"Keylayout_title" = "Keylayout";
"Keylayout_description" = "Ten moduł pozwala użytkownikowi zdefiniować mapowania klawiatury.";


// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "Narzędzia";
"Utility_description" = "Opcjonalne pliki przydatne w konfiguracji.";

"PrefPanel_title" = "Panel Preferencji";
"PrefPanel_description" = "Instaluje Panel Preferencji dla Chameleona.";

"SMBIOS_title" = "SMBIOS.plist";
"SMBIOS_description" = "Kopiuje domyślne smbios.plist w /Extra/Configuration.";

"Documentation_title" = "Dokumentacja";
"Documentation_description" = "Dokumentacja dla użytkowania i instalacji ręcznej Chameleona.";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "Opcje Bootowania";
"Options_description" = "Utwórz /Extra/com.apple.Boot.plist i wybierz swoje żądane opcje by kontrolować ustawienia Chameleona.";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Ukrywa boot banner Chameleona w GUI.";

"GUI_title" = "GUI=No";
"GUI_description" = "Wyłącza domyślnie włączony Graficzny Interfejs Użytkownika.";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Używa oryginalnego logo Apple (szare na białym) w ekranie ładowania, zamiast boot.png.";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Wyświetla ekran wyboru partycji od razu, bez pokazywania odliczania.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Włącza cichy tryb uruchamiania (brak komunikatów i potwierdzeń).";

"ShowInfo_title" = "ShowInfo=Yes";
"ShowInfo_description" = "Enables display of partition and resolution details.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Wstrzymuje proces uruchamiania. Gdy Chameleon zakończy przygotowanie do uruchomienia kernela, będzie czekał na naciśnięcie klawisza zanim go uruchomi. Przydatne z opcją Verbose do wyszukiwania błędów.";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "Uruchamia kernela w trybie 32 bitowym zamiast domyślnego 64 bitowego.";

"EHCIacquire_title" = "EHCIacquire=Yes";
"EHCIacquire_description" = "Włącza opcję naprawy problemów własności EHCI na niepoprawnych biosach.";

"EthernetBuiltIn_title" = "EthernetBuiltIn=Yes";
"EthernetBuiltIn_description" = "Włącza opcję dodania: 'wbudowany' ('built-in') do twoich urządzeń Ethernetowych.";

"ForceHPET_title" = "ForceHPET=Yes";
"ForceHPET_description" = "Włącza HPET na chipsetach Intela, dla biosów, które nie zawierają tej opcji.";

"ForceWake_title" = "ForceWake=Yes";
"ForceWake_description" = "Ta opcja pozwala obejść złe zrzuty pamięci hibernacji (sleep images).";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Wyłącza domyślnie włączoną poprawkę restartu.";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "Włącza opcję resetu kontrolerów UHCI przed uruchomieniem OS X.";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Wyłącza domyślnie włączone rozpoznawanie pamięci RAM.";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "Tylko dla OS X Lion. Włącza ładowanie pre-linkownego kernela. Będzie ignorować zawartość /E/E i /S/L/E. Używaj TYLKO, jeśli wiesz gdzie i co masz.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Próbuje wczytać zrzut pamięci (sleep image) zapisany podczas ostatniej hibernacji.";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "Nowa - Generate C-States=Yes";
"CSTUsingSystemIO_description" = "Nowa metoda generowania _CST C-State przy użyciu rejestrów SystemIO zamiast FixedHW.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Odrzuca wbudowane tablice SSDT płyty głównej.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Włącza określony stan wydajności CPU, C2";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Włącza określony stan wydajności CPU, C3";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Włącza określony stan wydajności CPU, C4";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Włącza automatyczne generowanie stanów C-States procesora.";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Włącza automatyczne generowanie stanów P-States procesora.";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "Ustawia tryb graficzny na 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "Ustawia tryb graficzny na 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "Ustawia tryb graficzny na 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "Ustawia tryb graficzny na 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "Ustawia tryb graficzny na 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "Ustawia tryb graficzny na 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "Ustawia tryb graficzny na 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "Ustawia tryb graficzny na 1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "Ustawia tryb graficzny na 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "Ustawia tryb graficzny na 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "Ustawia tryb graficzny na 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Włącza opcję automatycznego wykrywania GPU NVIDII i umieszczania odpowiednich informacji.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Włącza opcję UseAtiROM.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Włącza opcję UseNvidiaROM.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Włącza opcję VBIOS.";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "Verbose Mode";
"Verbose_description" = "Włącza komunikaty diagnostyczne z kernela OS X oraz bootlodera. Niezbędne przy szukaniu problemów.";

"Singleusermode_title" = "Single User Mode";
"Singleusermode_description" = "Opcja wykorzystywana przy naprawianiu problemów, Uruchamia system w trybie poleceń BSD/Unix.";

"Ignorecaches_title" = "Ignore Caches";
"Ignorecaches_description" = "Nie przydaje się przy każdym uruchamianiu, ale może być użyteczne jeśli chcesz, by system przeładował wszystkie pliki, zamiast ładowania cache.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "Czasem naprawia błąd PCI Configuration Begin";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Tylko dla OSX Lion. Wyłącza budzenie z niskim użyciem energii 'low power wake', które czasem zostawia czarny ekran po uśpieniu.";


// ----------------------------------------------------------------------------
// Boot options - KEYLAYOUTS
// ----------------------------------------------------------------------------

"mac-de_title" = "German Mac Keyboard";
"mac-de_description" = "Użyj układu klawiatury: German Mac";

"mac-es_title" = "Spanish Mac Keyboard";
"mac-es_description" = "Użyj układu klawiatury: Spanish Mac";

"mac-fr_title" = "French Mac Keyboard";
"mac-fr_description" = "Użyj układu klawiatury: French Mac";

"mac-it_title" = "Italian Mac Keyboard";
"mac-it_description" = "Użyj układu klawiatury: Italian Mac";

"mac-se_title" = "Swedish Mac Keyboard";
"mac-se_description" = "Użyj układu klawiatury: Swedish Mac";

"pc-fr_title" = "French PC Keyboard";
"pc-fr_description" = "Użyj układu klawiatury: French PC";


// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "Mniejsza, prosta wersja nowego tematu, domyślnie używana podczas tworzenia wersji Chameleona, który wymaga osadzonych tematów. ";

"Legacy_title" = "Legacy";
"Legacy_description" = "Poprzedni domyślny temat Chameleona.";

"Default_title" = "Standard";
"Default_description" = "Nowy domyślny temat Chameleona.";

"Bullet_title" = "Bullet";
"Bullet_description" = "Piękny, prosty temat autorstwa NoSmokingBandit z kwietnia 2009.";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "Kontrola chameleona";
"Control_description" = "Ustawienia działania Chameleona.";

// General
"General_title" = "Ogólne opcje";
"General_description" = "Wybierz ogólne opcje.";

// KernelFlags
"KernelFlags_title" = "Flagi kernela";
"KernelFlags_description" = "Wybierz flagi kernela.";

// PowerManagement
"PowerManagement_title" = "Zarządzanie energią";
"PowerManagement_description" = "Wybierz ustawienia związane z zarządzaniem energią i SpeedSteepem.";

// Resolution
"Resolution_title" = "Rozdzielczość";
"Resolution_description" = "Ustaw rozdzielczość ekranu dla twojego monitora.";

// Video
"Video_title" = "Grafika";
"Video_description" = "Wybierz ustawienia związane z obsługą grafiki.";

// KeyLayout
"KeyLayout_title" = "KeyLayout";
"KeyLayout_description" = "Wybierz układ klawiatury, lub wybierz 'Żaden', jeśli nie chcesz wybierać.";

// Themes
"Themes_title" = "Tematy";
"Themes_description" = "Kolekcja przykładowych tematów graficznych.
Więcej tematów znajdziesz na http://forum.voodooprojects.org/index.php/board,7.0.html";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "Żadna";
"ChooseNone-Resolution_description" = "Nie wybieraj rozdzielczości.";

"ChooseNone-keylayout_title" = "Żaden";
"ChooseNone-keylayout_description" = "Nie wybieraj układu klawiatury.";
